garyPenhook/PyAvrOCD/svd/avr16eb20.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PORTMUX</name>
      <description>Port Multiplexer</description>
      <baseAddress>0x008005E0</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x3</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x5</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xC</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CCLROUTEA</name>
          <description>CCL route A</description>
          <addressOffset>0x1</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LUT0</name>
              <description>CCL Look-Up Table 0 Signals</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>Out: PA3 In: PA0, PA1, PA2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1</name>
                  <description>Out: PA6 In: PA0, PA1, PA2</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LUT1</name>
              <description>CCL Look-Up Table 1 Signals</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>Out: PC3 In: PC0, PC1, PC2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1</name>
                  <description>Out: - In: PC0, PC1, PC2</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LUT2</name>
              <description>CCL Look-Up Table 2 Signals</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>Not connected to any pins</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1</name>
                  <description>Out: PD6 In: -, -, -</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVSYSROUTEA</name>
          <description>EVSYS route A</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVOUTA</name>
              <description>Event Output A</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>EVOUTA: PA2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1</name>
                  <description>EVOUTA: PA7</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EVOUTC</name>
              <description>Event Output C</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>EVOUTC: PC2</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EVOUTD</name>
              <description>Event Output D</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>Not connected to any pins</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1</name>
                  <description>EVOUTD: PD7</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EVOUTF</name>
              <description>Event Output F</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>Not connected to any pins</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1</name>
                  <description>EVOUTF: PF7</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SPIROUTEA</name>
          <description>SPI route A</description>
          <addressOffset>0x5</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SPI0</name>
              <description>SPI0 Signals</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>MOSI: PA4, MISO: PA5, SCK: PA6, SS: PA7</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3</name>
                  <description>MOSI: PA0, MISO: PA1, SCK: PC0, SS: PC1</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4</name>
                  <description>MOSI: PD4, MISO: PD5, SCK: PD6, SS: PD7</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5</name>
                  <description>MOSI: PC0, MISO: PC1, SCK: PC2, SS: PC3</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6</name>
                  <description>MOSI: PC1, MISO: PC2, SCK: PC3, SS: PF7</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Not connected to any pins, SS set to 1</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TCBROUTEA</name>
          <description>TCB route A</description>
          <addressOffset>0x8</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TCB0</name>
              <description>TCB0 Output</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>WO: PA2</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TCB1</name>
              <description>TCB1 Output</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>WO: PA3</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TCEROUTEA</name>
          <description>TCE route A</description>
          <addressOffset>0x7</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TCE0</name>
              <description>TCE0 Signals</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PORTA</name>
                  <description>WOn: PA0, PA1, PA2, PA3, PA4, PA5, PA6, PA7</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC</name>
                  <description>WOn: PC0, PC1, PC2, PC3, -, -, -, -</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTD</name>
                  <description>WOn: -, -, -, -, PD4, PD5, PD6, PD7</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC2</name>
                  <description>WOn: PA0, PA1, PC0, PC1, PC2, PC3, -, -</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTA2</name>
                  <description>WOn: PA2, PA3, PA4, PA5, PA6, PA7, -, -</description>
                  <value>9</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TCFROUTEA</name>
          <description>TCF Route A</description>
          <addressOffset>0xC</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TCF0</name>
              <description>TCF0 Output</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>WOn: PA0, PA1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1</name>
                  <description>WOn: PA6, PA7</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TWIROUTEA</name>
          <description>TWI route A</description>
          <addressOffset>0x6</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TWI0</name>
              <description>TWI0 Signals</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>SDA: PA2, SCL: PA3. Dual mode: SDA: PC2, SCL: PC3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1</name>
                  <description>SDA: PA2, SCL: PA3. Dual mode: SDA: -, SCL: -</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2</name>
                  <description>SDA: PC2, SCL: PC3. Dual mode: SDA: -, SCL: -</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3</name>
                  <description>SDA: PA0, SCL: PA1. Dual mode: SDA: PC2, SCL: PC3</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>USARTROUTEA</name>
          <description>USART route A</description>
          <addressOffset>0x2</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>USART0</name>
              <description>USART0 Routing</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>TxD: PA0, RxD: PA1, XCK: PA2, XDIR: PA3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1</name>
                  <description>TxD: PA4, RxD: PA5, XCK: PA6, XDIR: PA7</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2</name>
                  <description>TxD: PA2, RxD: PA3, XCK: -, XDIR: -</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3</name>
                  <description>TxD: PD4, RxD: PD5, XCK: PD6, XDIR: PD7</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4</name>
                  <description>TxD: PC1, RxD: PC2, XCK: PC3, XDIR: -</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6</name>
                  <description>TxD: PF7, RxD: PF6, XCK: -, XDIR: -</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Not connected to any pins</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
